package de.telran.homeWorkJava.hWJ_011024.training.tail_1;

import java.util.Scanner;
//Напишите программу, которая принимает строку от пользователя и извлекает из неё:
//
//Первую половину строки.
//Последние 3 символа строки.
//Подстроку с символами, начиная с 3-го до 7-го (включительно).
public class Wort {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите фразу : ");
        String wort =scanner.nextLine();

//        System.out.println("Первая половина строки : " + wort.substring(0,wort.length()/2 + 2));
//        System.out.println("Последние 3 символа : " + wort.substring(wort.length()-3));
//        System.out.println("Подстрока : " + wort.substring(3,wort.length()-5));




    }
}
